MCD/MCD_uml.puml
' Generated by Mocodo 4.3.2

@startuml "MCD"

!define Table(x) class "x" << (T,#c0d4ff) >>
!define pk(x) <b>x</b>
hide methods
left to right direction
skinparam groupInheritance 2
skinparam lineThickness 2
skinparam lineColor #85956b
skinparam backgroundColor None
skinparam classAttributeFontColor #3e3c42
skinparam classAttributeFontName Monospaced
skinparam classAttributeFontSize 14
skinparam classBackgroundColor #c0d4ff
skinparam classBorderColor #578dff
skinparam classBorderThickness 2
skinparam classFontColor #131114
skinparam classFontName Arial
skinparam classFontSize 18
skinparam classHeaderBackgroundColor #97b8ff

Table("GENRE") {
    {field} + pk(identifiant_TMDB_genre)
    {field} + nom
}

"MÉDIA" "*" --- "*" "GENRE": "POSSÉDER"

Table("MÉDIA") {
    {field} + pk(identifiant_TMDB)
    {field} + titre
    {field} + type
    {field} + slug
    {field} + affiche
    {field} + synopsis
    {field} + année
    {field} + réalisateur
}

"RECETTE" "1" --- "*" "MÉDIA": "ÊTRE_ASSOCIÉE"

Table("INGRÉDIENT") {
    {field} + pk(nom)
    {field} + approuvé
}

"RECETTE" "*" --- "1..*" "INGRÉDIENT": "CONTENIR"
("RECETTE", "INGRÉDIENT") .. "CONTENIR"
Table("CONTENIR") {
    {field} + quantité
    {field} + unité
}

Table("RECETTE") {
    {field} + pk(titre)
    {field} + slug
    {field} + statut
    {field} + motif_refus
    {field} + nombre_personnes
    {field} + temps_préparation
    {field} + temps_cuisson
    {field} + photo
}

"UTILISATEUR" "1" --- "*" "RECETTE": "CRÉER"

Table("UTILISATEUR") {
    {field} + pk(email)
    {field} + pseudo
    {field} + nom
    {field} + rôle
    {field} + dernière_connexion
}

Table("CATÉGORIE") {
    {field} + pk(nom)
    {field} + description
    {field} + couleur
}

"RECETTE" "*" --- "1" "CATÉGORIE": "APPARTENIR"

"UTILISATEUR" "1" --- "*" "NOTIFICATION": "RECEVOIR"

Table("NOTIFICATION") {
    {field} + pk(type)
    {field} + message
    {field} + lu
}

@enduml
